areiter128/pstpl-p33c-tdal/p33c_pral/exth/p33c_msi-d.h
        MSI1CON_t   MSI1CON;    // MSI1CON: MSI Control Register
        MSI1STAT_t  MSI1STAT;   // MSI1STAT: MSI Status Register
        MSI1KEY_t   MSI1KEY;    // MSI1KEY: MSI InterLock Key Register
        MSI1MBXS_t  MSI1MBXS;   // MSI1MBXS: MSI Mailbox Data Transfer Status Register
        MSI1MBX0D_t  MSI1MBX0D;   // MSI1MBX0D: MSI Mailbox 0 Data Register 
        MSI1MBX1D_t  MSI1MBX1D;   // MSI1MBX1D: MSI Mailbox 1 Data Register
        MSI1MBX2D_t  MSI1MBX2D;   // MSI1MBX2D: MSI Mailbox 2 Data Register
        MSI1MBX3D_t  MSI1MBX3D;   // MSI1MBX3D: MSI Mailbox 3 Data Register
        MSI1MBX4D_t  MSI1MBX4D;   // MSI1MBX4D: MSI Mailbox 4 Data Register
        MSI1MBX5D_t  MSI1MBX5D;   // MSI1MBX5D: MSI Mailbox 5 Data Register
        MSI1MBX6D_t  MSI1MBX6D;   // MSI1MBX6D: MSI Mailbox 6 Data Register
        MSI1MBX7D_t  MSI1MBX7D;   // MSI1MBX7D: MSI Mailbox 7 Data Register
        MSI1MBX8D_t  MSI1MBX8D;   // MSI1MBX8D: MSI Mailbox 8 Data Register
        MSI1MBX9D_t  MSI1MBX9D;   // MSI1MBX9D: MSI Mailbox 9 Data Register
        MSI1MBX10D_t MSI1MBX10D; // MSI1MBX10D: MSI Mailbox 10 Data Register
        MSI1MBX11D_t MSI1MBX11D; // MSI1MBX11D: MSI Mailbox 11 Data Register
        MSI1MBX12D_t MSI1MBX12D; // MSI1MBX12D: MSI Mailbox 12 Data Register
        MSI1MBX13D_t MSI1MBX13D; // MSI1MBX13D: MSI Mailbox 13 Data Register    
        MSI1MBX14D_t MSI1MBX14D; // MSI1MBX14D: MSI Mailbox 14 Data Register
        MSI1MBX15D_t MSI1MBX15D; // MSI1MBX15D: MSI Mailbox 15 Data Register
        MSI1FIFOCS_t MSI1FIFOCS;// MSI1FIFOCS: MSI FIFO Control/Status Register  
        MRSWFDATA_t MRSWFDATA;  // MRSWFDATA: MSI Master Read (Slave Write) FIFO Data Register
        MWSRFDATA_t MWSRFDATA;  // MWSRFDATA: Master Write (Slave Read) FIFO Data Register

    #elif defined (__P33SMPS_CHS__)  
        SI1CON_t    SI1CON;     // SI1CON: SI Control Register
        SI1STAT_t   SI1STAT;    // SI1STAT: SI Status Register
        SI1MBXS_t   SI1MBXS;    // SI1MBXS: SI Mailbox Data Transfer Status Register
        SI1MBX0D_t  SI1MBX0D;   // SI1MBX0D: SI Mailbox 0 Data Register 
        SI1MBX1D_t  SI1MBX1D;   // SI1MBX1D: SI Mailbox 1 Data Register
        SI1MBX2D_t  SI1MBX2D;   // SI1MBX2D: SI Mailbox 2 Data Register
        SI1MBX3D_t  SI1MBX3D;   // SI1MBX3D: SI Mailbox 3 Data Register
        SI1MBX4D_t  SI1MBX4D;   // SI1MBX4D: SI Mailbox 4 Data Register
        SI1MBX5D_t  SI1MBX5D;   // SI1MBX5D: SI Mailbox 5 Data Register
        SI1MBX6D_t  SI1MBX6D;   // SI1MBX6D: SI Mailbox 6 Data Register
        SI1MBX7D_t  SI1MBX7D;   // SI1MBX7D: SI Mailbox 7 Data Register
        SI1MBX8D_t  SI1MBX8D;   // SI1MBX8D: SI Mailbox 8 Data Register
        SI1MBX9D_t  SI1MBX9D;   // SI1MBX9D: SI Mailbox 9 Data Register
        SI1MBX10D_t SI1MBX10D; // SI1MBX10D: SI Mailbox 10 Data Register
        SI1MBX11D_t SI1MBX11D; // SI1MBX11D: SI Mailbox 11 Data Register
        SI1MBX12D_t SI1MBX12D; // SI1MBX12D: SI Mailbox 12 Data Register
        SI1MBX13D_t SI1MBX13D; // SI1MBX13D: SI Mailbox 13 Data Register    
        SI1MBX14D_t SI1MBX14D; // SI1MBX14D: SI Mailbox 14 Data Register
        SI1MBX15D_t SI1MBX15D; // SI1MBX15D: SI Mailbox 15 Data Register
        SI1FIFOCS_t SI1FIFOCS;  // SI1FIFOCS: SI FIFO Control/Status Register 
        SWMRFDATA_t SWMRFDATA;  // SWMRFDATA: Slave Write (Master Read) FIFO Data Register
        SRMWFDATA_t SRMWFDATA;  // SRMWFDATA: Slave Read (Master Write) FIFO Data Register

    #endif
        
    } __attribute__((aligned));
    
    typedef struct P33C_MSI_MODULE_s P33C_MSI_MODULE_t; // MSI MODULE REGISTER SET
    
    /*********************************************************************************
     * @fn      volatile P33C_MSI_MODULE_t* p33c_MsiModule_GetHandle(void)
     * @ingroup p33c-pral-msi-module-methods
     * @brief   Gets pointer to MSI Module SFR set
     * @param   void
     * @return  P33C_MSI_MODULE_t Pointer to MSI module special function register set object 
     *  
     * @details
     *  This function returns the pointer to a MSI module register set in
     *  Special Function Register memory space. This pointer can be used to 
     *  directly write to/read from the Special Function Registers of the 
     *  DMA peripheral module configuration.
     *********************************************************************************/
    #if defined (__P33SMPS_CHM__) 
    #define p33c_MsiModule_GetHandle() (P33C_MSI_MODULE_t*)&MSI1CON
    #elif defined (__P33SMPS_CHS__) 
    #define p33c_MsiModule_GetHandle() (P33C_MSI_MODULE_t*)&SI1CON
    #endif
    
#endif // end of P33C_MSI_MODULE_s    
#endif  /* __P33SMPS_CH__ */
#endif	/* End of P33C_MSI_SFR_DECLARATIONS_H */

// ______________________________
// end of file
